## Pandas DataFrame

pandas 에서는 표와 같은 2차원 데이터 처리를 위해 DataFrame을 제공한다

In [1]:
import pandas as  pd

In [2]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

index 와 cloumns 를 입력하지 않아도 자동으로 생성된다!

___
### Numpy 의 배열 데이터 이용

In [4]:
import numpy as np

In [5]:
data_list = np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(data_list)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

index 와 columns 도 지정할 수 있다

In [6]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_data =pd.date_range('2019-09-01', periods=4)
columns_list = ['A','B','C']
pd.DataFrame(data,index=index_data,columns=columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

### 딕셔너리 데이터를 이용해 DataFrame 생성

In [9]:
table_data = {'연도':[2015,2016,2016,2017,2017],
              '지사':['한국','한국','미국','한국','미국'],
              '고객 수': [200,250,450,300,500]}
table_data

{'고객 수': [200, 250, 450, 300, 500],
 '연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국']}

In [10]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

**Key 순서 정렬**

columns = columns_list 를 이용해 딕셔너리 key의 순서를 지정할 수 있다

In [11]:
df = pd.DataFrame(table_data, columns=['지사','연도','고객 수'])
df

   지사    연도  고객 수
0  한국  2015   200
1  한국  2016   250
2  미국  2016   450
3  한국  2017   300
4  미국  2017   500

### index, columns, values 알아보기

In [12]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df.columns

Index(['지사', '연도', '고객 수'], dtype='object')

In [14]:
df.values

array([['한국', 2015, 200],
       ['한국', 2016, 250],
       ['미국', 2016, 450],
       ['한국', 2017, 300],
       ['미국', 2017, 500]], dtype=object)